Ran Plan for dir: `live/dev/aws/vpc` workspace: `default`

<details><summary>Show Output</summary>

```diff
[90m07:52:10.982 [0m[32mINFO   [0mDownloading Terraform configurations from file://../../../../modules/aws into ./.terragrunt-cache/DvXFA4MNe6Tj81Mtig1ebz-R6g4/L-WnlN_GUbjESkTgs1hI6V90TXk
[90m07:52:11.249 [0m[37mSTDOUT [0m[36mterraform: [0m[0m[1mInitializing the backend...[0m[0m
[90m07:52:11.254 [0m[37mSTDOUT [0m[36mterraform: [0m[0m[1mInitializing provider plugins...[0m[0m
[90m07:52:11.254 [0m[37mSTDOUT [0m[36mterraform: [0m- Finding hashicorp/aws versions matching ">= 4.35.0"...
[90m07:52:11.396 [0m[37mSTDOUT [0m[36mterraform: [0m- Installing hashicorp/aws v5.70.0...
[90m07:52:19.289 [0m[37mSTDOUT [0m[36mterraform: [0m- Installed hashicorp/aws v5.70.0 (signed by HashiCorp)
[90m07:52:19.289 [0m[37mSTDOUT [0m[36mterraform: [0mTerraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider[0m
[90m07:52:19.289 [0m[37mSTDOUT [0m[36mterraform: [0mselections it made above. Include this file in your version control repository
[90m07:52:19.289 [0m[37mSTDOUT [0m[36mterraform: [0mso that Terraform can guarantee to make the same selections by default when
[90m07:52:19.289 [0m[37mSTDOUT [0m[36mterraform: [0myou run "terraform init" in the future.[0m[0m
[90m07:52:19.291 [0m[37mSTDOUT [0m[36mterraform: [0m[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m[0m
[90m07:52:19.291 [0m[37mSTDOUT [0m[36mterraform: [0m[0m[32m[0m
[90m07:52:19.291 [0m[37mSTDOUT [0m[36mterraform: [0mYou may now begin working with Terraform. Try running "terraform plan" to see
[90m07:52:19.291 [0m[37mSTDOUT [0m[36mterraform: [0many changes that are required for your infrastructure. All Terraform commands
[90m07:52:19.291 [0m[37mSTDOUT [0m[36mterraform: [0mshould now work.
[90m07:52:19.291 [0m[37mSTDOUT [0m[36mterraform: [0mIf you ever set or change modules or backend configuration for Terraform,
[90m07:52:19.291 [0m[37mSTDOUT [0m[36mterraform: [0mrerun this command to reinitialize your working directory. If you forget, other
[90m07:52:19.291 [0m[37mSTDOUT [0m[36mterraform: [0mcommands will detect it and remind you to do so if necessary.[0m[0m

[90m07:52:19.702 [0m[37mSTDOUT [0m[36mterraform: [0m[0m[1mInitializing the backend...[0m[0m
[90m07:52:22.276 [0m[37mSTDOUT [0m[36mterraform: [0m[0m[1mInitializing provider plugins...[0m[0m
[90m07:52:22.276 [0m[37mSTDOUT [0m[36mterraform: [0m- Reusing previous version of hashicorp/aws from the dependency lock file
[90m07:52:25.025 [0m[37mSTDOUT [0m[36mterraform: [0m- Using previously-installed hashicorp/aws v5.70.0
[90m07:52:25.025 [0m[37mSTDOUT [0m[36mterraform: [0m[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m[0m
[90m07:52:25.025 [0m[37mSTDOUT [0m[36mterraform: [0m[0m[32m[0m
[90m07:52:25.025 [0m[37mSTDOUT [0m[36mterraform: [0mYou may now begin working with Terraform. Try running "terraform plan" to see
[90m07:52:25.025 [0m[37mSTDOUT [0m[36mterraform: [0many changes that are required for your infrastructure. All Terraform commands
[90m07:52:25.025 [0m[37mSTDOUT [0m[36mterraform: [0mshould now work.
[90m07:52:25.025 [0m[37mSTDOUT [0m[36mterraform: [0mIf you ever set or change modules or backend configuration for Terraform,
[90m07:52:25.025 [0m[37mSTDOUT [0m[36mterraform: [0mrerun this command to reinitialize your working directory. If you forget, other
[90m07:52:25.025 [0m[37mSTDOUT [0m[36mterraform: [0mcommands will detect it and remind you to do so if necessary.[0m[0m
[90m07:52:36.428 [0m[37mSTDOUT [0m[36mterraform: [0mTerraform used the selected providers to generate the following execution
[90m07:52:36.428 [0m[37mSTDOUT [0m[36mterraform: [0mplan. Resource actions are indicated with the following symbols:
[90m07:52:36.428 [0m[37mSTDOUT [0m[36mterraform: [0m  [32m+[0m create[0m
[90m07:52:36.428 [0m[37mSTDOUT [0m[36mterraform: [0m[0m[0m
[90m07:52:36.428 [0m[37mSTDOUT [0m[36mterraform: [0mTerraform will perform the following actions:
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_default_network_acl.this[0][0m will be created[0m[0m[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_default_network_acl" "this" {[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0marn[0m[0m                    = (known after apply)[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mdefault_network_acl_id[0m[0m = (known after apply)[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mowner_id[0m[0m               = (known after apply)[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags[0m[0m                   = {[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-default"[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-default"[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mvpc_id[0m[0m                 = (known after apply)[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0megress {[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0maction[0m[0m          = "allow"[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mfrom_port[0m[0m       = 0[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mipv6_cidr_block[0m[0m = "::/0"[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mprotocol[0m[0m        = "-1"[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mrule_no[0m[0m         = 101[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mto_port[0m[0m         = 0[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0megress {[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0maction[0m[0m     = "allow"[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mcidr_block[0m[0m = "0.0.0.0/0"[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mfrom_port[0m[0m  = 0[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mprotocol[0m[0m   = "-1"[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mrule_no[0m[0m    = 100[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mto_port[0m[0m    = 0[0m
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.431 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0mingress {[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0maction[0m[0m          = "allow"[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mfrom_port[0m[0m       = 0[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mipv6_cidr_block[0m[0m = "::/0"[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mprotocol[0m[0m        = "-1"[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mrule_no[0m[0m         = 101[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mto_port[0m[0m         = 0[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0mingress {[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0maction[0m[0m     = "allow"[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mcidr_block[0m[0m = "0.0.0.0/0"[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mfrom_port[0m[0m  = 0[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mprotocol[0m[0m   = "-1"[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mrule_no[0m[0m    = 100[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mto_port[0m[0m    = 0[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_default_route_table.default[0][0m will be created[0m[0m[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_default_route_table" "default" {[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0marn[0m[0m                    = (known after apply)[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mdefault_route_table_id[0m[0m = (known after apply)[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mowner_id[0m[0m               = (known after apply)[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mroute[0m[0m                  = (known after apply)[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags[0m[0m                   = {[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-default"[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-default"[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.432 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mvpc_id[0m[0m                 = (known after apply)[0m
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0mtimeouts {[0m
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mcreate[0m[0m = "5m"[0m
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mupdate[0m[0m = "5m"[0m
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_default_security_group.this[0][0m will be created[0m[0m[0m
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_default_security_group" "this" {[0m
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0marn[0m[0m                    = (known after apply)[0m
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mdescription[0m[0m            = (known after apply)[0m
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0megress[0m[0m                 = (known after apply)[0m
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)[0m
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mingress[0m[0m                = (known after apply)[0m
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mname[0m[0m                   = (known after apply)[0m
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mname_prefix[0m[0m            = (known after apply)[0m
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mowner_id[0m[0m               = (known after apply)[0m
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mrevoke_rules_on_delete[0m[0m = false[0m
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags[0m[0m                   = {[0m
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-default"[0m
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {[0m
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-default"[0m
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mvpc_id[0m[0m                 = (known after apply)[0m
[90m07:52:36.433 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.434 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_eip.nat[0][0m will be created[0m[0m[0m
[90m07:52:36.434 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_eip" "nat" {[0m
[90m07:52:36.434 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mallocation_id[0m[0m        = (known after apply)[0m
[90m07:52:36.434 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0marn[0m[0m                  = (known after apply)[0m
[90m07:52:36.434 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0massociation_id[0m[0m       = (known after apply)[0m
[90m07:52:36.434 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mcarrier_ip[0m[0m           = (known after apply)[0m
[90m07:52:36.434 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mcustomer_owned_ip[0m[0m    = (known after apply)[0m
[90m07:52:36.434 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mdomain[0m[0m               = (known after apply)[0m
[90m07:52:36.434 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)[0m
[90m07:52:36.434 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0minstance[0m[0m             = (known after apply)[0m
[90m07:52:36.434 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mnetwork_border_group[0m[0m = (known after apply)[0m
[90m07:52:36.434 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mnetwork_interface[0m[0m    = (known after apply)[0m
[90m07:52:36.434 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mprivate_dns[0m[0m          = (known after apply)[0m
[90m07:52:36.434 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mprivate_ip[0m[0m           = (known after apply)[0m
[90m07:52:36.434 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mptr_record[0m[0m           = (known after apply)[0m
[90m07:52:36.434 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mpublic_dns[0m[0m           = (known after apply)[0m
[90m07:52:36.434 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mpublic_ip[0m[0m            = (known after apply)[0m
[90m07:52:36.434 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mpublic_ipv4_pool[0m[0m     = (known after apply)[0m
[90m07:52:36.435 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags[0m[0m                 = {[0m
[90m07:52:36.435 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.435 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-eu-west-1a"[0m
[90m07:52:36.435 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.435 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.435 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags_all[0m[0m             = {[0m
[90m07:52:36.435 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.435 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-eu-west-1a"[0m
[90m07:52:36.435 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.435 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.435 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mvpc[0m[0m                  = true[0m
[90m07:52:36.435 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.435 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_eip.nat[1][0m will be created[0m[0m[0m
[90m07:52:36.435 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_eip" "nat" {[0m
[90m07:52:36.435 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mallocation_id[0m[0m        = (known after apply)[0m
[90m07:52:36.435 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0marn[0m[0m                  = (known after apply)[0m
[90m07:52:36.435 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0massociation_id[0m[0m       = (known after apply)[0m
[90m07:52:36.435 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mcarrier_ip[0m[0m           = (known after apply)[0m
[90m07:52:36.435 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mcustomer_owned_ip[0m[0m    = (known after apply)[0m
[90m07:52:36.435 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mdomain[0m[0m               = (known after apply)[0m
[90m07:52:36.436 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)[0m
[90m07:52:36.436 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0minstance[0m[0m             = (known after apply)[0m
[90m07:52:36.436 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mnetwork_border_group[0m[0m = (known after apply)[0m
[90m07:52:36.436 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mnetwork_interface[0m[0m    = (known after apply)[0m
[90m07:52:36.436 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mprivate_dns[0m[0m          = (known after apply)[0m
[90m07:52:36.436 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mprivate_ip[0m[0m           = (known after apply)[0m
[90m07:52:36.436 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mptr_record[0m[0m           = (known after apply)[0m
[90m07:52:36.436 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mpublic_dns[0m[0m           = (known after apply)[0m
[90m07:52:36.436 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mpublic_ip[0m[0m            = (known after apply)[0m
[90m07:52:36.436 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mpublic_ipv4_pool[0m[0m     = (known after apply)[0m
[90m07:52:36.436 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags[0m[0m                 = {[0m
[90m07:52:36.436 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.436 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-eu-west-1b"[0m
[90m07:52:36.436 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.436 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.436 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags_all[0m[0m             = {[0m
[90m07:52:36.437 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.437 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-eu-west-1b"[0m
[90m07:52:36.437 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.437 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.437 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mvpc[0m[0m                  = true[0m
[90m07:52:36.437 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.437 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_eip.nat[2][0m will be created[0m[0m[0m
[90m07:52:36.437 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_eip" "nat" {[0m
[90m07:52:36.437 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mallocation_id[0m[0m        = (known after apply)[0m
[90m07:52:36.437 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0marn[0m[0m                  = (known after apply)[0m
[90m07:52:36.437 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0massociation_id[0m[0m       = (known after apply)[0m
[90m07:52:36.437 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mcarrier_ip[0m[0m           = (known after apply)[0m
[90m07:52:36.437 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mcustomer_owned_ip[0m[0m    = (known after apply)[0m
[90m07:52:36.437 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mdomain[0m[0m               = (known after apply)[0m
[90m07:52:36.437 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)[0m
[90m07:52:36.437 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0minstance[0m[0m             = (known after apply)[0m
[90m07:52:36.438 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mnetwork_border_group[0m[0m = (known after apply)[0m
[90m07:52:36.438 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mnetwork_interface[0m[0m    = (known after apply)[0m
[90m07:52:36.438 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mprivate_dns[0m[0m          = (known after apply)[0m
[90m07:52:36.438 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mprivate_ip[0m[0m           = (known after apply)[0m
[90m07:52:36.438 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mptr_record[0m[0m           = (known after apply)[0m
[90m07:52:36.438 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mpublic_dns[0m[0m           = (known after apply)[0m
[90m07:52:36.438 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mpublic_ip[0m[0m            = (known after apply)[0m
[90m07:52:36.438 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mpublic_ipv4_pool[0m[0m     = (known after apply)[0m
[90m07:52:36.438 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags[0m[0m                 = {[0m
[90m07:52:36.438 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.438 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-eu-west-1c"[0m
[90m07:52:36.439 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.439 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.439 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags_all[0m[0m             = {[0m
[90m07:52:36.439 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.439 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-eu-west-1c"[0m
[90m07:52:36.439 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.439 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.439 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mvpc[0m[0m                  = true[0m
[90m07:52:36.439 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.439 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_internet_gateway.this[0][0m will be created[0m[0m[0m
[90m07:52:36.439 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_internet_gateway" "this" {[0m
[90m07:52:36.439 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0marn[0m[0m      = (known after apply)[0m
[90m07:52:36.439 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)[0m
[90m07:52:36.439 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mowner_id[0m[0m = (known after apply)[0m
[90m07:52:36.439 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags[0m[0m     = {[0m
[90m07:52:36.439 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.440 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc"[0m
[90m07:52:36.440 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.440 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.440 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags_all[0m[0m = {[0m
[90m07:52:36.440 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.440 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc"[0m
[90m07:52:36.440 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.440 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.440 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mvpc_id[0m[0m   = (known after apply)[0m
[90m07:52:36.440 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.442 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_nat_gateway.this[0][0m will be created[0m[0m[0m
[90m07:52:36.442 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_nat_gateway" "this" {[0m
[90m07:52:36.442 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mallocation_id[0m[0m                      = (known after apply)[0m
[90m07:52:36.442 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0massociation_id[0m[0m                     = (known after apply)[0m
[90m07:52:36.442 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mconnectivity_type[0m[0m                  = "public"[0m
[90m07:52:36.442 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m                                 = (known after apply)[0m
[90m07:52:36.442 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m               = (known after apply)[0m
[90m07:52:36.442 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mprivate_ip[0m[0m                         = (known after apply)[0m
[90m07:52:36.442 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mpublic_ip[0m[0m                          = (known after apply)[0m
[90m07:52:36.442 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0msecondary_private_ip_address_count[0m[0m = (known after apply)[0m
[90m07:52:36.442 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0msecondary_private_ip_addresses[0m[0m     = (known after apply)[0m
[90m07:52:36.442 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0msubnet_id[0m[0m                          = (known after apply)[0m
[90m07:52:36.442 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags[0m[0m                               = {[0m
[90m07:52:36.442 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.442 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-eu-west-1a"[0m
[90m07:52:36.442 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.443 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.443 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags_all[0m[0m                           = {[0m
[90m07:52:36.443 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.443 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-eu-west-1a"[0m
[90m07:52:36.443 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.443 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.443 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.443 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_nat_gateway.this[1][0m will be created[0m[0m[0m
[90m07:52:36.443 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_nat_gateway" "this" {[0m
[90m07:52:36.443 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mallocation_id[0m[0m                      = (known after apply)[0m
[90m07:52:36.443 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0massociation_id[0m[0m                     = (known after apply)[0m
[90m07:52:36.443 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mconnectivity_type[0m[0m                  = "public"[0m
[90m07:52:36.443 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m                                 = (known after apply)[0m
[90m07:52:36.443 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m               = (known after apply)[0m
[90m07:52:36.443 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mprivate_ip[0m[0m                         = (known after apply)[0m
[90m07:52:36.443 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mpublic_ip[0m[0m                          = (known after apply)[0m
[90m07:52:36.443 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0msecondary_private_ip_address_count[0m[0m = (known after apply)[0m
[90m07:52:36.444 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0msecondary_private_ip_addresses[0m[0m     = (known after apply)[0m
[90m07:52:36.444 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0msubnet_id[0m[0m                          = (known after apply)[0m
[90m07:52:36.444 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags[0m[0m                               = {[0m
[90m07:52:36.444 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.444 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-eu-west-1b"[0m
[90m07:52:36.444 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.444 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.444 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags_all[0m[0m                           = {[0m
[90m07:52:36.444 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.444 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-eu-west-1b"[0m
[90m07:52:36.444 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.444 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.444 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.444 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_nat_gateway.this[2][0m will be created[0m[0m[0m
[90m07:52:36.444 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_nat_gateway" "this" {[0m
[90m07:52:36.444 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mallocation_id[0m[0m                      = (known after apply)[0m
[90m07:52:36.444 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0massociation_id[0m[0m                     = (known after apply)[0m
[90m07:52:36.444 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mconnectivity_type[0m[0m                  = "public"[0m
[90m07:52:36.444 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m                                 = (known after apply)[0m
[90m07:52:36.444 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m               = (known after apply)[0m
[90m07:52:36.444 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mprivate_ip[0m[0m                         = (known after apply)[0m
[90m07:52:36.444 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mpublic_ip[0m[0m                          = (known after apply)[0m
[90m07:52:36.444 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0msecondary_private_ip_address_count[0m[0m = (known after apply)[0m
[90m07:52:36.445 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0msecondary_private_ip_addresses[0m[0m     = (known after apply)[0m
[90m07:52:36.445 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0msubnet_id[0m[0m                          = (known after apply)[0m
[90m07:52:36.445 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags[0m[0m                               = {[0m
[90m07:52:36.445 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.445 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-eu-west-1c"[0m
[90m07:52:36.445 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.445 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.445 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags_all[0m[0m                           = {[0m
[90m07:52:36.445 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.445 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-eu-west-1c"[0m
[90m07:52:36.445 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.445 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.445 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.445 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_route.private_nat_gateway[0][0m will be created[0m[0m[0m
[90m07:52:36.445 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route" "private_nat_gateway" {[0m
[90m07:52:36.445 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mdestination_cidr_block[0m[0m = "0.0.0.0/0"[0m
[90m07:52:36.445 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)[0m
[90m07:52:36.445 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0minstance_id[0m[0m            = (known after apply)[0m
[90m07:52:36.445 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0minstance_owner_id[0m[0m      = (known after apply)[0m
[90m07:52:36.445 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mnat_gateway_id[0m[0m         = (known after apply)[0m
[90m07:52:36.445 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m   = (known after apply)[0m
[90m07:52:36.445 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0morigin[0m[0m                 = (known after apply)[0m
[90m07:52:36.446 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mroute_table_id[0m[0m         = (known after apply)[0m
[90m07:52:36.446 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mstate[0m[0m                  = (known after apply)[0m
[90m07:52:36.446 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0mtimeouts {[0m
[90m07:52:36.446 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mcreate[0m[0m = "5m"[0m
[90m07:52:36.446 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.446 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.446 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_route.private_nat_gateway[1][0m will be created[0m[0m[0m
[90m07:52:36.446 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route" "private_nat_gateway" {[0m
[90m07:52:36.446 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mdestination_cidr_block[0m[0m = "0.0.0.0/0"[0m
[90m07:52:36.446 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)[0m
[90m07:52:36.446 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0minstance_id[0m[0m            = (known after apply)[0m
[90m07:52:36.446 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0minstance_owner_id[0m[0m      = (known after apply)[0m
[90m07:52:36.446 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mnat_gateway_id[0m[0m         = (known after apply)[0m
[90m07:52:36.446 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m   = (known after apply)[0m
[90m07:52:36.446 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0morigin[0m[0m                 = (known after apply)[0m
[90m07:52:36.446 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mroute_table_id[0m[0m         = (known after apply)[0m
[90m07:52:36.446 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mstate[0m[0m                  = (known after apply)[0m
[90m07:52:36.446 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0mtimeouts {[0m
[90m07:52:36.446 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mcreate[0m[0m = "5m"[0m
[90m07:52:36.447 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.447 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.447 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_route.private_nat_gateway[2][0m will be created[0m[0m[0m
[90m07:52:36.447 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route" "private_nat_gateway" {[0m
[90m07:52:36.447 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mdestination_cidr_block[0m[0m = "0.0.0.0/0"[0m
[90m07:52:36.447 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)[0m
[90m07:52:36.447 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0minstance_id[0m[0m            = (known after apply)[0m
[90m07:52:36.447 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0minstance_owner_id[0m[0m      = (known after apply)[0m
[90m07:52:36.447 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mnat_gateway_id[0m[0m         = (known after apply)[0m
[90m07:52:36.447 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m   = (known after apply)[0m
[90m07:52:36.447 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0morigin[0m[0m                 = (known after apply)[0m
[90m07:52:36.447 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mroute_table_id[0m[0m         = (known after apply)[0m
[90m07:52:36.447 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mstate[0m[0m                  = (known after apply)[0m
[90m07:52:36.447 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0mtimeouts {[0m
[90m07:52:36.447 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mcreate[0m[0m = "5m"[0m
[90m07:52:36.447 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.447 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.447 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_route.public_internet_gateway[0][0m will be created[0m[0m[0m
[90m07:52:36.447 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route" "public_internet_gateway" {[0m
[90m07:52:36.447 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mdestination_cidr_block[0m[0m = "0.0.0.0/0"[0m
[90m07:52:36.447 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mgateway_id[0m[0m             = (known after apply)[0m
[90m07:52:36.447 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)[0m
[90m07:52:36.448 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0minstance_id[0m[0m            = (known after apply)[0m
[90m07:52:36.448 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0minstance_owner_id[0m[0m      = (known after apply)[0m
[90m07:52:36.448 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m   = (known after apply)[0m
[90m07:52:36.448 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0morigin[0m[0m                 = (known after apply)[0m
[90m07:52:36.448 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mroute_table_id[0m[0m         = (known after apply)[0m
[90m07:52:36.448 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mstate[0m[0m                  = (known after apply)[0m
[90m07:52:36.448 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0mtimeouts {[0m
[90m07:52:36.448 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m[1m[0mcreate[0m[0m = "5m"[0m
[90m07:52:36.448 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.448 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.448 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_route_table.private[0][0m will be created[0m[0m[0m
[90m07:52:36.448 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route_table" "private" {[0m
[90m07:52:36.448 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0marn[0m[0m              = (known after apply)[0m
[90m07:52:36.448 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)[0m
[90m07:52:36.448 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mowner_id[0m[0m         = (known after apply)[0m
[90m07:52:36.448 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mpropagating_vgws[0m[0m = (known after apply)[0m
[90m07:52:36.448 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mroute[0m[0m            = (known after apply)[0m
[90m07:52:36.449 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags[0m[0m             = {[0m
[90m07:52:36.449 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.449 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-private-eu-west-1a"[0m
[90m07:52:36.449 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.449 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.449 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags_all[0m[0m         = {[0m
[90m07:52:36.449 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.449 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-private-eu-west-1a"[0m
[90m07:52:36.449 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.449 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.449 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mvpc_id[0m[0m           = (known after apply)[0m
[90m07:52:36.449 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.449 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_route_table.private[1][0m will be created[0m[0m[0m
[90m07:52:36.449 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route_table" "private" {[0m
[90m07:52:36.449 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0marn[0m[0m              = (known after apply)[0m
[90m07:52:36.449 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)[0m
[90m07:52:36.449 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mowner_id[0m[0m         = (known after apply)[0m
[90m07:52:36.449 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mpropagating_vgws[0m[0m = (known after apply)[0m
[90m07:52:36.449 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mroute[0m[0m            = (known after apply)[0m
[90m07:52:36.449 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags[0m[0m             = {[0m
[90m07:52:36.449 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.449 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-private-eu-west-1b"[0m
[90m07:52:36.449 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.450 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.450 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags_all[0m[0m         = {[0m
[90m07:52:36.450 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.450 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-private-eu-west-1b"[0m
[90m07:52:36.450 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.450 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.450 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mvpc_id[0m[0m           = (known after apply)[0m
[90m07:52:36.450 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.450 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_route_table.private[2][0m will be created[0m[0m[0m
[90m07:52:36.450 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route_table" "private" {[0m
[90m07:52:36.450 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0marn[0m[0m              = (known after apply)[0m
[90m07:52:36.450 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)[0m
[90m07:52:36.450 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mowner_id[0m[0m         = (known after apply)[0m
[90m07:52:36.450 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mpropagating_vgws[0m[0m = (known after apply)[0m
[90m07:52:36.450 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mroute[0m[0m            = (known after apply)[0m
[90m07:52:36.450 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags[0m[0m             = {[0m
[90m07:52:36.450 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.450 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-private-eu-west-1c"[0m
[90m07:52:36.450 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.450 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.450 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags_all[0m[0m         = {[0m
[90m07:52:36.450 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.451 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-private-eu-west-1c"[0m
[90m07:52:36.451 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.451 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.451 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mvpc_id[0m[0m           = (known after apply)[0m
[90m07:52:36.451 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.451 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_route_table.public[0][0m will be created[0m[0m[0m
[90m07:52:36.451 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route_table" "public" {[0m
[90m07:52:36.451 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0marn[0m[0m              = (known after apply)[0m
[90m07:52:36.451 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)[0m
[90m07:52:36.452 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mowner_id[0m[0m         = (known after apply)[0m
[90m07:52:36.452 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mpropagating_vgws[0m[0m = (known after apply)[0m
[90m07:52:36.452 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mroute[0m[0m            = (known after apply)[0m
[90m07:52:36.452 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags[0m[0m             = {[0m
[90m07:52:36.452 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.452 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-public"[0m
[90m07:52:36.452 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.452 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.452 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags_all[0m[0m         = {[0m
[90m07:52:36.452 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.452 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-public"[0m
[90m07:52:36.452 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.452 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.452 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mvpc_id[0m[0m           = (known after apply)[0m
[90m07:52:36.452 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.452 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_route_table_association.private[0][0m will be created[0m[0m[0m
[90m07:52:36.452 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route_table_association" "private" {[0m
[90m07:52:36.453 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)[0m
[90m07:52:36.453 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mroute_table_id[0m[0m = (known after apply)[0m
[90m07:52:36.453 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0msubnet_id[0m[0m      = (known after apply)[0m
[90m07:52:36.453 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.453 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_route_table_association.private[1][0m will be created[0m[0m[0m
[90m07:52:36.453 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route_table_association" "private" {[0m
[90m07:52:36.453 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)[0m
[90m07:52:36.453 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mroute_table_id[0m[0m = (known after apply)[0m
[90m07:52:36.453 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0msubnet_id[0m[0m      = (known after apply)[0m
[90m07:52:36.453 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.453 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_route_table_association.private[2][0m will be created[0m[0m[0m
[90m07:52:36.453 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route_table_association" "private" {[0m
[90m07:52:36.453 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)[0m
[90m07:52:36.453 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mroute_table_id[0m[0m = (known after apply)[0m
[90m07:52:36.453 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0msubnet_id[0m[0m      = (known after apply)[0m
[90m07:52:36.453 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.454 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_route_table_association.public[0][0m will be created[0m[0m[0m
[90m07:52:36.454 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route_table_association" "public" {[0m
[90m07:52:36.454 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)[0m
[90m07:52:36.454 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mroute_table_id[0m[0m = (known after apply)[0m
[90m07:52:36.454 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0msubnet_id[0m[0m      = (known after apply)[0m
[90m07:52:36.454 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.454 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_route_table_association.public[1][0m will be created[0m[0m[0m
[90m07:52:36.454 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route_table_association" "public" {[0m
[90m07:52:36.454 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)[0m
[90m07:52:36.454 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mroute_table_id[0m[0m = (known after apply)[0m
[90m07:52:36.455 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0msubnet_id[0m[0m      = (known after apply)[0m
[90m07:52:36.455 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.455 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_route_table_association.public[2][0m will be created[0m[0m[0m
[90m07:52:36.455 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_route_table_association" "public" {[0m
[90m07:52:36.455 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)[0m
[90m07:52:36.455 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mroute_table_id[0m[0m = (known after apply)[0m
[90m07:52:36.455 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0msubnet_id[0m[0m      = (known after apply)[0m
[90m07:52:36.455 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.455 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_subnet.private[0][0m will be created[0m[0m[0m
[90m07:52:36.455 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_subnet" "private" {[0m
[90m07:52:36.455 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0marn[0m[0m                                            = (known after apply)[0m
[90m07:52:36.455 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0massign_ipv6_address_on_creation[0m[0m                = false[0m
[90m07:52:36.455 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                              = "eu-west-1a"[0m
[90m07:52:36.455 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m                           = (known after apply)[0m
[90m07:52:36.456 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mcidr_block[0m[0m                                     = "10.0.1.0/24"[0m
[90m07:52:36.456 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0menable_dns64[0m[0m                                   = false[0m
[90m07:52:36.456 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0menable_resource_name_dns_a_record_on_launch[0m[0m    = false[0m
[90m07:52:36.456 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0menable_resource_name_dns_aaaa_record_on_launch[0m[0m = false[0m
[90m07:52:36.456 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m                                             = (known after apply)[0m
[90m07:52:36.456 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mipv6_cidr_block_association_id[0m[0m                 = (known after apply)[0m
[90m07:52:36.456 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mipv6_native[0m[0m                                    = false[0m
[90m07:52:36.456 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mmap_public_ip_on_launch[0m[0m                        = false[0m
[90m07:52:36.456 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mowner_id[0m[0m                                       = (known after apply)[0m
[90m07:52:36.456 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mprivate_dns_hostname_type_on_launch[0m[0m            = (known after apply)[0m
[90m07:52:36.456 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags[0m[0m                                           = {[0m
[90m07:52:36.456 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.456 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-private-eu-west-1a"[0m
[90m07:52:36.456 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.456 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.456 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags_all[0m[0m                                       = {[0m
[90m07:52:36.456 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.456 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-private-eu-west-1a"[0m
[90m07:52:36.456 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.456 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.457 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mvpc_id[0m[0m                                         = (known after apply)[0m
[90m07:52:36.457 [0m[37mSTDOUT [0m[36mterraform: [0m    }
[90m07:52:36.457 [0m[37mSTDOUT [0m[36mterraform: [0m[1m  # aws_subnet.private[1][0m will be created[0m[0m[0m
[90m07:52:36.457 [0m[37mSTDOUT [0m[36mterraform: [0m[0m  [32m+[0m[0m resource "aws_subnet" "private" {[0m
[90m07:52:36.457 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0marn[0m[0m                                            = (known after apply)[0m
[90m07:52:36.457 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0massign_ipv6_address_on_creation[0m[0m                = false[0m
[90m07:52:36.457 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mavailability_zone[0m[0m                              = "eu-west-1b"[0m
[90m07:52:36.457 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m                           = (known after apply)[0m
[90m07:52:36.457 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mcidr_block[0m[0m                                     = "10.0.2.0/24"[0m
[90m07:52:36.457 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0menable_dns64[0m[0m                                   = false[0m
[90m07:52:36.457 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0menable_resource_name_dns_a_record_on_launch[0m[0m    = false[0m
[90m07:52:36.457 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0menable_resource_name_dns_aaaa_record_on_launch[0m[0m = false[0m
[90m07:52:36.457 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mid[0m[0m                                             = (known after apply)[0m
[90m07:52:36.457 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mipv6_cidr_block_association_id[0m[0m                 = (known after apply)[0m
[90m07:52:36.457 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mipv6_native[0m[0m                                    = false[0m
[90m07:52:36.457 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mmap_public_ip_on_launch[0m[0m                        = false[0m
[90m07:52:36.457 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mowner_id[0m[0m                                       = (known after apply)[0m
[90m07:52:36.457 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mprivate_dns_hostname_type_on_launch[0m[0m            = (known after apply)[0m
[90m07:52:36.457 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags[0m[0m                                           = {[0m
[90m07:52:36.457 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Environment" = "dev"[0m
[90m07:52:36.457 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Name"        = "my-vpc-private-eu-west-1b"[0m
[90m07:52:36.457 [0m[37mSTDOUT [0m[36mterraform: [0m          [32m+[0m [0m"Terraform"   = "true"[0m
[90m07:52:36.458 [0m[37mSTDOUT [0m[36mterraform: [0m        }
[90m07:52:36.458 [0m[37mSTDOUT [0m[36mterraform: [0m      [32m+[0m [0m[1m[0mtags_all[0m[0m                                       = {[0m
[90m07:52:36.458 [0m[37mSTDOUT [0m
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.